/*********************************************************************************************************
*   说    明: CAN数据转发---(完成)
*   开发平台: 剑齿虎STM8开发板        
*   众想论坛: https://www.zxkjmcu.com
*   淘宝网店: https://zxkjmcu.taobao.com
*   关注微信公众平台微信号："众想科技  或者  zxkj-ly"，免费获取STM8资料。
*   哈尔滨卓恩科技开发有限公司
*
*   作    者: 刘洋 张殿东
*   版    本: V1.0
*   日    期: 2016-03-01      
**********************************************************************************************************/

#include "pbdata.h"

void BSP_Configuration(void);

/*********************************************************************************************************
*   函 数 名: main
*   功能说明: c程序入口
*   形    参：无
*   返 回 值: 错误代码(无需处理)
**********************************************************************************************************/

int main(void)
{
    BSP_Configuration();//初始化硬件
    
    while(1)
    {
       CAN_Demo();
       delay_ms(1000);
    }
}

/**********************************************************************************************************
*   函 数 名: BSP_Configuration
*   功能说明: 初始化硬件设备。只需要调用一次。该函数配置CPU寄存器和外设的寄存器并初始化一些全局变量。
*   形    参：无
*   返 回 值: 无
**********************************************************************************************************/
void BSP_Configuration(void)
{
    CLK_HSIPrescalerConfig(CLK_PRESCALER_HSIDIV1);  //配置内部高速振荡器（HSI）的分频器--1分频
    
    CAN_Config();
    __enable_interrupt();//中断使能
}

void assert_failed(u8* file, u32 line)
{ 
  while (1)
  {
  }
}